PC5/IntroRuby/app/controllers/movies_controller.rb

  def show

    id = params[:id] # retrieve movie ID from URI route

    begin
      @movie = Movie.find(id) # look up movie by unique ID
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]

  def index
    @all_ratings = Movie.all_ratings
    ratings_form = params[:ratings] || {}
    @ratings_to_show = ratings_form.keys
    @movies = Movie.all

    if @ratings_to_show.empty?
      @ratings_to_show = @all_ratings
    end

    # @movies = Movie.where(rating: @ratings_to_show).order(:title)

    @movies = Movie.where(rating: @ratings_to_show)
---
SELECT "movies".* FROM "movies"  ORDER BY "movies"."movie" ASC
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG-13')