Pruebas-JS-Ajax/Pruebas.JS-Ajax-main/app/controllers/movies_controller.rb

  def create
    if (@movie = Movie.create(movie_params))
---
INSERT INTO "movies" ("title", "rating", "description", "release_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "T"], ["rating", "G"], ["description", nil], ["release_date", "2023-10-31 00:00:00"], ["created_at", "2023-10-31 01:22:13.195627"], ["updated_at", "2023-10-31 01:22:13.195627"]]

  def update
    @movie = Movie.find params[:id]
    if @movie.update(movie_params)
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 27], ["LIMIT", 1]]
UPDATE "movies" SET "title" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["title", "Prueba 2"], ["updated_at", "2023-11-25 23:26:34.691467"], ["id", 27]]